IDEA Open Model
CrossSectionFactory.FillCssTarc Method
Compatible with IDEA StatiCa 20.1
 Creates one item cross-section T - steel shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillCssTarc(
	CrossSectionParameter css,
	double cssGeomB,
	double cssGeomH,
	double cssGeomTw,
	double cssGeomTf,
	double cssGeomR,
	double cssGeomR1,
	double cssGeomR2,
	double tapperF,
	double tapperW
)
Public Shared Sub FillCssTarc (
	css As CrossSectionParameter,
	cssGeomB As Double,
	cssGeomH As Double,
	cssGeomTw As Double,
	cssGeomTf As Double,
	cssGeomR As Double,
	cssGeomR1 As Double,
	cssGeomR2 As Double,
	tapperF As Double,
	tapperW As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
cssGeomB
Type: System.Double
Css width
cssGeomH
Type: System.Double
Height of cross-section
cssGeomTw
Type: System.Double
Web thickness
cssGeomTf
Type: System.Double
Flange thickness
cssGeomR
Type: System.Double
Inside radius
cssGeomR1
Type: System.Double
Flange edge rounding radius
cssGeomR2
Type: System.Double
Web edge rounding radius
tapperF
Type: System.Double
Flange tapper
tapperW
Type: System.Double
Web tapper
Return Value
Type:
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 9;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double cssGeomB = 0.25;
double cssGeomH = 0.30;
double cssGeomTw = 0.02;
double cssGeomTf = 0.03;
double cssGeomR = 0.015;
double cssGeomR1 = 0.008;
double cssGeomR2 = 0.0010;
double tapperF = Math.PI / 180.0 * 5.0;
double tapperW = Math.PI / 180.0 * 7.0;
CrossSectionFactory.FillCssTarc(css, cssGeomB, cssGeomH, cssGeomTw, cssGeomTf, cssGeomR, cssGeomR1, cssGeomR2, tapperF, tapperW);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace